using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Mail2 : Mail
{
    // Start is called before the first frame update
    void Start()
    {
        content = "《权力网络深厚，恶魔逃脱法律制裁》\n事件发生于一所私立学校，作为特殊教育学校，它既能获得政府补助，又能向企业募款，受到《私立学校法》和当时实行的《社会福祉事业法》的双重保护，自主经营，不受外界监督。性侵的悲剧正是在这样密闭的环境中笼罩了无助的孩子。该校十五六名男女童遭其侵害，最大的孩子十五岁，最小的只有四岁半。龚正区特校是“一师一校”的典型，平时由审案老师一人授课，没有其他教学人员。现年69岁的老师曾因猥亵儿童受到教育局行政处分，但未被移送司法机关。他退休后被返聘至该校任教。\n我们的记者明察暗访，搜集了大量的资料和证据。今天，犯罪者依然游离于法律之外，没有得到应有的惩罚，我们非常愤怒。我们想比起监管不力，更令人悲哀的是“卡特尔”权力结构的形成。卡特尔原本是经济学术语，指在一些资源被数个寡头企业完全掌握的领域中，由寡头企业组成联盟，通过协议或规定来控制产品的产量和价格，来避免过度竞争导致的整体利益下跌。卡特尔是经济垄断组织的一种表现形式。而在这个案件中我们看到的是“权力卡特尔”。受害儿童面对的不只是一个强奸犯，而是一个有着共同利益网的庞大集团。涉案的校长动用各种手段，如用权力打压、利益输送等方式，疏通当地法官、检察官，取得被害儿童监护人的和解，并最终以处罚最轻的缓刑避开了法律的实际惩罚。自由市场中一旦形成卡特尔，消费者的利益就有可能会受到损害。在庐市，当地的上层阶层，如学校校长、政府官员、法官、律师、检察官，本来应该相互制衡，却相互结盟，形成了一种权力的闭环式垄断——“权力卡特尔”，共同宰制社会资源。任何企图挑战这张权力网络的群体，都会遭到他们的联合围剿。大家都是同学、朋友的亲戚、亲戚的朋友，通过人际、血缘等和腐败的权力结盟，就无法揭发不合理的现象，形成这种无力的状态。\n尽管如此，我们依然怀抱希望，我们已同步将所有搜集到的证据提交到了法院邮箱以及请愿平台。\n真实的唯一缺点就是太懒惰了。真实总是为自己拥有真相而骄傲，赤裸裸地将真相呈现出来，不做任何粉饰，也不试图说服別人。因此真实偶尔太突兀，太不合逻辑，也让人不舒服。非真实的东西不断地努力，掩饰矛盾之处，在它们忙着伪装时，真实或许只是躺在那里等着柿子掉进嘴巴里面。这个世界总是忽视真实，也许有一定的道理。被告判处轻刑，并得以缓刑，翻译成手语的瞬间，法庭内充满了听觉障碍人士发出的惊呼声。我们想的仅仅是把被弄权者们扭曲的真实与正义，在法庭之上重新树立起来。\n灾难与犯罪发生并不是我们的责任，但对灾难与犯罪报以何种态度则是我们的责任。\n权力超乎想象地让我们巩固在一起，也让我们获得了意想不到的武器，那就是社交平台和网上的新闻。出现需要批判的事情时，不要让它就那样过去，哪怕只是回复一个评论，也绝不是可以小看的力量。虽然人类的历史浮浮沉沉，但总的来说，国民越拥有权利，那段历史就越是先进的历史。这是所有人类的共同点。希望更多人可以站出来支持正义，让真相公之于众！\n——编辑部全体成员";
    }

    // Update is called once per frame
    void Update()
    {
        
    }
}
