using UnityEngine;

public class MainStoryController : MonoBehaviour
{
    // 单例实例
    private static MainStoryController instance;
    public static MainStoryController Instance
    {
        get
        {
            // 如果实例为空，则查找场景中是否已存在ScriptManager对象
            if (instance == null)
            {
                instance = FindObjectOfType<MainStoryController>();

                // 如果场景中不存在ScriptManager对象，则创建一个新的空对象并添加ScriptManager组件
                // if (instance == null)
                // {
                //     GameObject obj = new GameObject("MainStoryController");
                //     instance = obj.AddComponent<MainStoryController>();
                // }
            }
            return instance;
        }
    }

    // 剧本内容数组
    //public string[] mainStoryLines;
    public int nowMainStoryIndex = 0;
    //控制事件的天数
    public int nowDay = 0;
    //控制剧情的天数
    public int systemDay = 0;
    public int nowOffset = 0;

    //用来判断有没有满足下班的条件
    public bool miniGame = true;
    public bool work = false;
    public bool mail = true;

    //不同的标题
    public string[,] mainStoryTitles;
    
    public string[,] mainStoryFeedBacks;

    //需要用一个int数组记录玩家的选择标题 这个int数组的长度等同于mainStoryLines的长度 并且需要存储他们对应的权重 是一个4*n的数组

    public int[] playerChoiceIndexs;
    public int[,] TitleWeight ;
    
    //使用一个int数据记录玩家的选择板块
    public int[] playerChoiceBlockIndexs;
    public int[,] BlockWeight ;

    public string[,] plot1;
    public string[,] plot2;

    public string[,] plot3;//进主线

    public string[,] plot4;//跳转前

    public string[,] plot5;//单独控制 从厕所回来以后加在这里

    public string[,] plot6;//进走廊前 应该是在第五天下班后

    public string[,] plot7;//第八天上班前

    public string[,] plot8;//第九天上班后

    public string[,] plot9;//第六天在家
    public string[,] plot10;//第七天在家


    // 在Awake方法中加载剧本内容（这里假设剧本内容已经存储在数组中）
    void ShuffleRows(string[,] array)
    {
        int rows = array.GetLength(0);
        int cols = array.GetLength(1);
        System.Random rng = new System.Random();

        for (int i = 0; i < rows; i++)
        {
            int randomIndex = rng.Next(i, rows);
            for (int j = 0; j < cols; j++)
            {
                // 交换当前行与随机行的元素
                string temp = array[i, j];
                array[i, j] = array[randomIndex, j];
                array[randomIndex, j] = temp;
            }
        }
    }
    void PrintArray(string[,] array)
    {
        int rows = array.GetLength(0);
        int cols = array.GetLength(1);

        for (int i = 0; i < rows; i++)
        {
            for (int j = 0; j < cols; j++)
            {
                Debug.Log(array[i, j] + "\t");
            }
            Debug.Log("\n");
        }
    }

    void Awake()
    {
        // 检查是否已存在单例实例
        if (instance == null)
        {
            // 如果不存在，则将当前实例设置为单例，并标记为不可销毁
            instance = this;
            DontDestroyOnLoad(gameObject);
        }
        else
        {
            // 如果存在其他实例，则销毁当前实例
            Destroy(gameObject);
        }
        // 例如，假设剧本内容存储在这个数组中
        /*mainStoryLines = new string[]
        {
            "市民田女士因夫妻矛盾被介绍给自称“妙法如来”转世的续某，她花费5万余元购买了五百瓶“甘露水”，后发现无效，报警后得知“甘露水”实为自来水。",
            "警方接到报警称功德箱内香火钱被偷，嫌疑人覃某辩称自己不是偷，而是问菩萨能否拿钱，称菩萨比了“OK”。",
            "田老太的儿子因诈骗被判刑，田老太拒绝退赔后，被何某以能改判减刑为由骗走30万元。",
            "一男子与同事争吵后决定徒步回B地，后被民警发现其走反了方向，并帮助他上了前往B地的火车。",
            "一司机在查酒驾时弃车跳河逃避检查，反复跳河3次，最终血检发现其酒精含量为0。",
            "一女子因多次迟到被公司辞退，申请劳动仲裁，但在仲裁开庭当天又迟到16分钟。",
            "一男子伪装成塑料袋在凌晨3点行窃写字楼，作案后用塑料袋套住自己离开。",
            "警方抓获一名窃贼，该窃贼认为中午犯案比早晚更安全，因为“早晚会被抓”。",
            "派出所接到报警，辖区一村民家门口摆放的两尊重达百斤石狮子一夜之间被人盗了。民警展开调查，经过几个小时的走访，查看监控，终于发现可疑线索，抓获了嫌疑人孙某。问及为何要盗窃这么沉的石狮子，孙某称：他路过报警人家门口，当即被石狮子吸引，仔细端详后，越看越顺眼。",
            "一书店有《周易》失窃，民警快速抓获嫌疑人曹某。曹某称，自己命不好，没钱买书，想偷本《周易》研究一下为什么。最终，曹某因盗窃被依法拘留。",
            "骗子尝试了4个小时也没能教会大妈如何转账，大妈因此逃过一劫。",
            "一男子希望被警方拘留但没有成功，于是致电热线希望得到帮助。原来其多年前因违法，后刑满释放，但现作息不规律，吕某担心再次犯罪，于是求助热线。",
            "沈女士与一男子网恋，被骗百万后被拉黑。沈女士报警后却又接到男子的主动联系。奔现被抓男子称：受害者很大方，自己动了真感情。",
            "某地法院公开审理一起开设赌场案，过程中警察发现旁听席一人似在逃犯罪嫌疑人。庭审结束后将男子当场制服，最终男子被刑拘。",
            "养了10多年的孩子，有一天竟发现不是自己的，这电视剧般的“狗血剧情”近日还真实地发生在一位男子身上，妻子离家出走，男子希望其能归家。他与妻子结婚16年最近才被妻子告知自己的三个女儿都不是他亲生的。",
            "犯罪嫌疑人被抓时仍在看刑法学讲义，书中“如何缓刑、减刑”等内容都被划了重点。网友疯狂调侃。",
            "儿媳到派出所接迷路的婆婆回家，半小时后女子又向警方求助：我俩又迷路了……",
            "一男子因涉嫌诈骗被警方抓获，为逃避调查，他装晕3天3夜，期间医生想尽办法，插尿管、上心电、掐人中等，他都纹丝不动，没有反应。哪知最后，因忍受不了民警在他床前吃饭太香被“唤醒”。目前，男子已被警方依法刑拘。",
            "某小伙家境殷实，但觉得管爸妈要钱“没面子”，选择白手起家自主创业，终于成为电信诈骗头目被捕。",
            "某地一群人聚餐，在室内吃炭锅，门窗紧闭导致全员一氧化碳中毒晕倒。最关键的是，期间有一个男子开门透气，结果朋友以为他喝多了，又给他拉回屋内。",
            // 添加更多的剧本内容...
        };
        */
        //填充剧本
        plot2 = new string[,]
        {   
            {"同事：","Hi~ o(*￣▽￣*)ブ"},
            {"同事：","（震惊）你刚刚一直在发呆等下班吗？！"},
            {"同事：","（震惊）这也太无聊了吧！"},
            {"我：","……"},
            {"同事：","（悄悄地）我和你说哈。其实你可以玩玩主机上的“小游戏”摸摸鱼的"},
            {"同事：","（骄傲(‾◡◝)）摸鱼的时光总是走得更快，信我！"},
            {"我：","（略尴尬和i）好……"},
        };

        plot1 = new string[,]
        {   
            {"同事：","早上好。今天是上班的第一天，记得查看新闻线索哦~"},
            {"我：","哦哦，好的。我当然记得啦！"},
            {"同事：","好，期待你的选题和排版！"},
        };

        plot3 = new string[,]
        {   
            {"我：","这个关于“庐市”听障特殊学校的线索有更多内容吗？"},
            {"同事：","嗯（思考状）没有了。哦，对了，听声音年龄很小，话语也感觉有些结巴。"},
            {"同事：","然后这个是接到的电话（给我电话号：101-203142）"},
            {"我：","感谢，打扰了！"},
            {"画外","*同事走开了*"},
            {"画外：","*你打了过去，没有人接……*"},
            {"画外：","*（显然，这不是一个移动电话号码）*"},
            {"画外：","*（不过或许我可以进一步缩小可能的范围）*"},
            {"画外：","*将电话号放到搜索引擎中查询归属地，结果显示来电归属于“庐市龚正区”*"},
            {"画外：","*打开地图搜索*"},
            {"我：","*显然，龚正区只有唯一一所听障特殊学校。或许我可以去碰碰运气……*"},
        };

        plot4 = new string[,]
        {   
            {"画外","*你决定马上前往当地进行调查！*"},
            {"画外：","*当然，你知道同当地提前取得联系是非常必要的*"},
            {"画外：","（不过告密者应该不会只向我们单位提供线索。或许我可以向警官了解一下情况……）"},
            {"画外：","*你打开电脑上的“线人档案”word翻看起来*"},
            {"画外：","*将电话号放到搜索引擎中查询归属地，结果显示来电归属于“庐市龚正区”*"},
            {"画外：","*打开地图搜索*"},
            {"我：","*你突然像被一道闪电劈中，眼前的场景和男孩的恐惧带你短暂进入了一段模糊的思绪*"},
        };

        plot5 = new string[,]
        {   
            {"画外","*你回过神来，看着陷入恐惧的男孩*"},
            {"我：","我不想对你们感到抱歉，我不想让相信我的你们失望——我一定会说出真相！"},
            {"画外：","*接下来你继续在校园内拍摄搜证、调查，向食堂阿姨、保安大叔等了解学校情况……*"},
            {"画外：","*天已渐渐黑了，你将资料整理进档案袋然后返回——明天你还得在公司上班*"},
        };

        plot6 = new string[,]
        {   
            {"画外","*工作桌面上摆着昨天蒐集资料的档案袋*"},
            {"画外","*你拿起档案袋，翻看起资料*"},
            {"画外：","*突然，你看到一张照片。照片的中心是昨天的小男孩*"},
            {"画外：","*背对着镜头，伫立在走廊中间，场景灰暗，照片的清晰度也很低*"},
            {"画外：","*这张照片同案件没有直接的联系，但你却呆呆地看着，入了迷*"},
        };

        plot7 = new string[,]
        {   
            {"画外","*你来到公司，准备上班*"},
            {"画外","*你扫视桌面，看到了两个信封*"},
            {"画外","*【这样的事情可太多了】，你一眼看出其中一个鼓鼓的信封里是什么，【你冷笑了一声】*"},
            {"画外","*你拿起另一个信封打开看*"},
            {"画外","*这时，一位同事过来了*"},
            {"同事：","Hi，最近如何？"},
            {"同事：","上完班后还要去实地调查，有没有发现什么？"},
            {"同事：","你有看今天的新闻吗？那个校长已经归校了"},
            {"同事：","其实那个校长和咱们boss私交好像还挺多的"},
            {"同事：","他能在龚正区办那么个特校，实力和背景感觉都不一般……"},
            {"画外","*同事知道你最近一头扎到了这个事件里，对你的状态有点担心*"},
            {"我：","谢谢你告诉我这些，我没事的"},
            {"同事：","祝你成功！（说完同事挥挥手走了）"},
            {"画外","【大家都是同学、朋友的亲戚、亲戚的朋友，通过人际、血缘等和腐败的权力结盟，就无法揭发不合理的现象，形成这种无力的状态。】"},
            {"画外","*你攥紧了手里的信封，这中间的证据能否帮助对抗这样一个强力的对手呢？你不知道*"},
            {"画外","*邮箱图标闪烁，有新邮件来了*"},
        };

        plot8 = new string[,]
        {   
            {"画外","*又结束一天工作日*"},
            {"画外","*叮铃铃~叮铃铃~阵阵铃声打扰了办公室的平静*"},
            {"画外","*你接起电话，电话那头的人异常热烈而高兴*"},
            {"来电方：","感谢你啦，你是一个识时务的小老弟。昨天的报道放到了角落的位置，一定是一个艰难的决定吧！"},
            {"来电方：","信封里的是小心意，你只管拿去用就好。"},
            {"来电方：","对了，你boss应该还没来得及跟你说，我同你们公司近期达成了合作，今天我们想要报道一下近些年我在这所学校的工作以及成果，"},
            {"来电方：","我们决定让你来负责，辛苦你啦。拜拜，期待你的到来。"},
            {"画外","*你只觉天旋地转，然后一种无力的感觉深深拉扯着你，仿佛要带你一起迷失……*"},
            {"画外","*你坐上公司派出的车辆，再次来到了龚正区听障特校*"},
            {"画外","*你又走进上次的教室，看到了孩子们*"},
            {"画外","*你不敢看他们的眼睛，仿佛害怕他们的目光会灼烧煎熬你的内心*"},
            {"画外","*今天你的任务主要是采访，而采访对象中赫然有小男孩……*"},
            {"画外","*最终这一刻还是来到了，在他面前你沉默了许久，直到同事碰你你才开始照本宣科*"},
            {"画外","*有些讽刺，小男孩的回答如此官方*"},
            {"画外","*话语的表达和表情动作等的表达之间明显的割裂在新闻记者的眼中应当是显然的*"},
            {"画外","*但今天的你却只是按着条目读着，正如小男孩僵硬地背诵着标准的答案……*"},
            {"画外","*你的思绪逐渐飞离现场，眼前的画面开始变化，你回到了记忆中的画面*"},
            {"画外","*这里插入多年前其他同学欺负你后班主任的推诿和事场景*"},
            {"画外","*班主任正背对着你同教导主任说明情况*"},
            {"班主任：","哎呀，其实没啥事，小孩子之间小打小闹"},
            {"班主任：","我也已经让他道歉了"},
            {"班主任：","而且双方都有错啦，不存在说偏袒哪一方的"},
            {"班主任：","主任你就放心吧"},
            {"班主任：","......"},
        };

        plot9 = new string[,]
        {   
            {"画外","*今天不上班，你如往常一般打开电视“做背景音”，然后开始分析手头的新闻任务*"},
            {"画外","*花边、花边还是花边，你没了兴趣。转头拿起报纸看起来....*"},
        };

        plot10 = new string[,]
        {   
            {"画外","*第七天也还是一样*"},
            {"画外","*突然，电视机的直播报道吸引了你的注意*"},
            {"画外","*电视上正转播着法院的判决现场，而当事的被告正是那个特校校长*"},
            {"法官：","法官：依据现有证据，被告判处3个月拘役，缓刑6个月。"},
            {"报道：","“被告判处轻刑，并得以缓刑，翻译成手语的瞬间，法庭内充满了听觉障碍人士发出的惊呼声。”"},
        };
        //为每个story添加3个可选的标题
        mainStoryTitles = new string[,]
        {
            {"市民田女士因夫妻矛盾被介绍给自称“妙法如来”转世的续某，她花费5万余元购买了五百瓶“甘露水”，后发现无效，报警后得知“甘露水”实为自来水。","花五万买大师加持“甘露水”喝后发现无效 ","“妙法如来”现某地，“甘露水”竟是“自来水”","夫妻矛盾引“神通”？“甘露水”不相信眼泪"},
            {"警方接到报警称功德箱内香火钱被偷，嫌疑人覃某辩称自己不是偷，而是问菩萨能否拿钱，称菩萨比了“OK”。","男子偷功德箱的钱称“菩萨给我比了OK ”","菩萨说可以我才拿的“盗亦有道”？！","香火钱变盗？菩萨“说OK”"},
            {"田老太的儿子因诈骗被判刑，田老太拒绝退赔后，被何某以能改判减刑为由骗走30万元。","儿子诈骗30万 老太拒绝退赔 后为捞儿子出狱老太被骗30万 ","骗子家庭上“减刑”当竞对能力值得认可！","诈骗款不会消失，但会转移"},
            {"一男子与同事争吵后决定徒步回B地，后被民警发现其走反了方向，并帮助他上了前往B地的火车。","男子争吵后不吃不喝欲从A地走回B地结果走反了","男子city walk“南辕北辙”也可到终点","男子暴走，只为徒步证明地球是圆的？！跟上男子的节奏！"},
            {"一司机在查酒驾时弃车跳河逃避检查，反复跳河3次，最终血检发现其酒精含量为0。","男子躲查酒驾3次跳河结果血检酒精含量为0","司机逃避酒驾检查3次，血检却是零","反复跳河躲检查！司机酒驾查出意外"},
            {"一女子因多次迟到被公司辞退，申请劳动仲裁，但在仲裁开庭当天又迟到16分钟。","入职58天迟到21次 被辞后申请仲裁开庭当天又迟到16分钟 ","女子亲验 21天真能养习惯！！！","迟到成习惯！女子申请仲裁当天再次迟到相当自律！"},
            {"一男子伪装成塑料袋在凌晨3点行窃写字楼，作案后用塑料袋套住自己离开。","伪装成塑料袋 男子凌晨3点写字楼行窃 ","奇招作案！ “塑料袋”行窃写字楼","塑料袋盗贼惊动警方！"},
            {"警方抓获一名窃贼，该窃贼认为中午犯案比早晚更安全，因为“早晚会被抓”。","窃贼专挑中午犯案 只因认为“早晚会被抓” ","注意进“chang”时机！","现代人时间意识有多强？ 盗贼犯案都狠抓Timing！！"},
            {"派出所接到报警，辖区一村民家门口摆放的两尊重达百斤石狮子一夜之间被人盗了。民警展开调查，经过几个小时的走访，查看监控，终于发现可疑线索，抓获了嫌疑人孙某。问及为何要盗窃这么沉的石狮子，孙某称：他路过报警人家门口，当即被石狮子吸引，仔细端详后，越看越顺眼。","男子盗窃百斤重石狮子就因为越看越顺眼","对视·对狮·对失","一见钟情 男子迈出120步实在越界"},
            {"一书店有《周易》失窃，民警快速抓获嫌疑人曹某。曹某称，自己命不好，没钱买书，想偷本《周易》研究一下为什么。最终，曹某因盗窃被依法拘留。","男子因“命不好”想研究一下到书店偷《周易》被抓","天机不可泄露 男子欲解命运遭“报应”","“周易”命不易 男子知天命"},
            {"骗子尝试了4个小时也没能教会大妈如何转账，大妈因此逃过一劫。","南京一大妈接到诈骗电话，骗子教大妈转账未遂","没有教师资格证当什么骗子？！","教学数时仍不会 银龄大妈被放弃 谁来关心未来的自己"},
            {"一男子希望被警方拘留但没有成功，于是致电热线希望得到帮助。原来其多年前因违法，后刑满释放，但现作息不规律，吕某担心再次犯罪，于是求助热线。","广东男子刑满释放后求助12345，想回看守所：我想过规律的生活","看守所的小房间才是我向往的家啊！","市民拨打热线求助 请求遭拒引热议"},
            {"沈女士与一男子网恋，被骗百万后被拉黑。沈女士报警后却又接到男子的主动联系。奔现被抓男子称：受害者很大方，自己动了真感情。","男子诈骗百万爱上受害人，奔现被抓：受害人很大方，自己动了真感情","百万女总我爱上","真花钱才是真爱你 男子遭pua失去自由"},
            {"某地法院公开审理一起开设赌场案，过程中警察发现旁听席一人似在逃犯罪嫌疑人。庭审结束后将男子当场制服，最终男子被刑拘。","一逃犯到法院旁听自己的案件，因座位太靠前被民警认出","枪打出头鸟 我就说听课不要太靠前","这么认真的人怎么可能不是坏人！"},
            {"养了10多年的孩子，有一天竟发现不是自己的，这电视剧般的“狗血剧情”近日还真实地发生在一位男子身上，妻子离家出走，男子希望其能归家。他与妻子结婚16年最近才被妻子告知自己的三个女儿都不是他亲生的。","血缘并非必须 真爱能敌十年","男子赡养无亲缘关系孩子十多年 果真人间有真情？！","男子养三孩十数年 终于崩溃大哭为那般？！"},
            {"犯罪嫌疑人被抓时仍在看刑法学讲义，书中“如何缓刑、减刑”等内容都被划了重点。网友疯狂调侃。","男子以身入局 检验司法实践","我太想进步了！","学而行——知行合一引群嘲"},
            {"儿媳到派出所接迷路的婆婆回家，半小时后女子又向警方求助：我俩又迷路了……","不是一家人 不进一家门","婆婆儿媳太相近 “我与你相似”","归家路漫漫 儿媳陪婆婆一起迷失"},
            {"一男子因涉嫌诈骗被警方抓获，为逃避调查，他装晕3天3夜，期间医生想尽办法，插尿管、上心电、掐人中等，他都纹丝不动，没有反应。哪知最后，因忍受不了民警在他床前吃饭太香被“唤醒”。目前，男子已被警方依法刑拘。","男子被抓装晕3天3夜 警察吃饭太香被馋醒：真的扛不住","这一刻，美食击败了自由","医生哪懂唤醒 警官给大白上了一课"},
            {"某小伙家境殷实，但觉得管爸妈要钱“没面子”，选择白手起家自主创业，终于成为电信诈骗头目被捕。","年度“励志”富二代的迷惑操作","不安心啃老？你这是违法行为！","是富二代，也是诈骗犯"},
            {"某地一群人聚餐，在室内吃炭锅，门窗紧闭导致全员一氧化碳中毒晕倒。最关键的是，期间有一个男子开门透气，结果朋友以为他喝多了，又给他拉回屋内。","《友谊地久天长》","一声兄弟感天地——岂能“独活”","“暖心”举动让人“窒息”"},
            {"女子网购5盒蟑螂到小区花坛放生，称“要给它们生命”。物业和保安赶到时，女子已经放生完了2盒蟑螂。","“没有买卖就没有伤害”","蟑螂也濒危？女子试图进行“迁地保护”","女子发动生物武器攻击 幸行动被小区终结止于60%进度"},
            {"小偷上海被抓出狱后表示：“哪里跌倒哪里爬起来。”于是坐高铁再赴上海行窃，然后又被抓了。","放不下的终会害了你","一个小偷的心结谁了解","心结未开 怎能归家"},
            {"女子去许愿池许愿，没带现金于是在池子里刷了银行卡，然后输了密码。当事人：许愿池应该知道我在做什么。","“投两个币吧，求求了。”“怎能凭空污人清白，给你刷卡倒不乐意了？”","银行卡还是方便硬币支付果然还是太落后","非现金消费新突破！“心理服务业”接入银行结算？"},
            {"40岁男子为报复10岁小孩连划7车，称总能划到小男孩家的。据悉，架是22年吵的，车是23年划的。","他只是10岁零360月的孩子 控制一年脾气已经很厉害了！","忍一时风平浪静退一步越想越气","“君子报仇”，一年反正不晚"},
            {"男子网恋1年多转账8万，发现女友竟是哥们儿的老婆。而这个女友当初就是哥们儿介绍的。","想过网恋可能被“骗钱骗感情”怎么也没想到被骗的还能是“友情”","我原来是你们play的一环嘛！","夫妻齐心，其力“断金”"},
        };
        //为每个story添加3个可选的反馈
        //用一种方法将mainStoryTtiles按行随机打乱
        ShuffleRows(mainStoryTitles);
        PrintArray(mainStoryTitles);

        //在mainStoryTitles的第十二个位置插入一条故事
        // mainStoryTitles[11] = new string[] { "近日，新闻组接到电话新闻线索。线索提供者举报称“庐市”听障特校存在恶性侵害事件。因现有线索有限，现特张贴线索征集启事。如您有任何线索，可以发送到邮箱xinwenxinwen@xw.com。", "庐市”特校疑似存在儿童侵害问题，诚求线索", "“特校”是天堂还是地狱，举报是否空穴来风？！", "今日线索征集——听障特校大求真" };
        //第四天 也就是第11个位置 第8天 也就是第17
        mainStoryTitles[10,0] = "近日，新闻组接到电话新闻线索。线索提供者举报称“庐市”听障特校存在恶性侵害事件。因现有线索有限，现特张贴线索征集启事。如您有任何线索，可以发送到邮箱xinwenxinwen@xw.com。";
        mainStoryTitles[10,1] = "庐市”特校疑似存在儿童侵害问题，诚求线索";
        mainStoryTitles[10,2] = "“特校”是天堂还是地狱，举报是否空穴来风？！";
        mainStoryTitles[10,3] = "今日线索征集——听障特校大求真";

        mainStoryTitles[17,0] = "师源（注：即老师是加害主体）性案件多发生在“一师一校”的环境里，在交通闭塞的山区，乡村小学里往往只有一位老师授课，外界缺乏对其有效监管。而庐市龚正区的这所特殊学校正是这样一个“一师一校”的特殊环境。近日法院进行了宣判，由于证据有限以及担保，被告校长被轻判且已释放。我们将对此事继续保持关注……";
        mainStoryTitles[17,1] = "近日，龚正案宣判";
        mainStoryTitles[17,2] = "近日，龚正案宣判";
        mainStoryTitles[17,3] = "近日，龚正案宣判";
        mainStoryFeedBacks = new string[,]
        {
            {"feedback1.1","feedback1.2","feedback1.3"},
            {"feedback2.1","feedback2.2","feedback2.3"},
            {"feedback3.1","feedback3.2","feedback3.3"},
            {"feedback4.1","feedback4.2","feedback4.3"},
            {"feedback5.1","feedback5.2","feedback5.3"},
        };
        //初始化玩家的选择 全部为0
        playerChoiceIndexs = new int[mainStoryTitles.Length];
        playerChoiceBlockIndexs = new int[mainStoryTitles.Length];
        //初始化权重 并给他们赋值为0
        

    }
}
