using UnityEngine;

public class MainStoryController : MonoBehaviour
{
    // 单例实例
    private static MainStoryController instance;
    public static MainStoryController Instance
    {
        get
        {
            // 如果实例为空，则查找场景中是否已存在ScriptManager对象
            if (instance == null)
            {
                instance = FindObjectOfType<MainStoryController>();

                // 如果场景中不存在ScriptManager对象，则创建一个新的空对象并添加ScriptManager组件
                // if (instance == null)
                // {
                //     GameObject obj = new GameObject("MainStoryController");
                //     instance = obj.AddComponent<MainStoryController>();
                // }
            }
            return instance;
        }
    }

    // 剧本内容数组
    //public string[] mainStoryLines;
    public int nowMainStoryIndex = 0;
    public int nowDay = 0;
    public int systemDay = 0;
    public int nowOffset = 0;

    //不同的标题
    public string[,] mainStoryTitles;
    
    public string[,] mainStoryFeedBacks;

    //需要用一个int数组记录玩家的选择标题 这个int数组的长度等同于mainStoryLines的长度 并且需要存储他们对应的权重 是一个4*n的数组

    public int[] playerChoiceIndexs;
    public int[,] TitleWeight ;
    
    //使用一个int数据记录玩家的选择板块
    public int[] playerChoiceBlockIndexs;
    public int[,] BlockWeight ;


    // 在Awake方法中加载剧本内容（这里假设剧本内容已经存储在数组中）
    void ShuffleRows(string[,] array)
    {
        int rows = array.GetLength(0);
        int cols = array.GetLength(1);
        System.Random rng = new System.Random();

        for (int i = 0; i < rows; i++)
        {
            int randomIndex = rng.Next(i, rows);
            for (int j = 0; j < cols; j++)
            {
                // 交换当前行与随机行的元素
                string temp = array[i, j];
                array[i, j] = array[randomIndex, j];
                array[randomIndex, j] = temp;
            }
        }
    }
    void PrintArray(string[,] array)
    {
        int rows = array.GetLength(0);
        int cols = array.GetLength(1);

        for (int i = 0; i < rows; i++)
        {
            for (int j = 0; j < cols; j++)
            {
                Debug.Log(array[i, j] + "\t");
            }
            Debug.Log("\n");
        }
    }

    void Awake()
    {
        // 检查是否已存在单例实例
        if (instance == null)
        {
            // 如果不存在，则将当前实例设置为单例，并标记为不可销毁
            instance = this;
            DontDestroyOnLoad(gameObject);
        }
        else
        {
            // 如果存在其他实例，则销毁当前实例
            Destroy(gameObject);
        }
        // 例如，假设剧本内容存储在这个数组中
        /*mainStoryLines = new string[]
        {
            "市民田女士因夫妻矛盾被介绍给自称“妙法如来”转世的续某，她花费5万余元购买了五百瓶“甘露水”，后发现无效，报警后得知“甘露水”实为自来水。",
            "警方接到报警称功德箱内香火钱被偷，嫌疑人覃某辩称自己不是偷，而是问菩萨能否拿钱，称菩萨比了“OK”。",
            "田老太的儿子因诈骗被判刑，田老太拒绝退赔后，被何某以能改判减刑为由骗走30万元。",
            "一男子与同事争吵后决定徒步回B地，后被民警发现其走反了方向，并帮助他上了前往B地的火车。",
            "一司机在查酒驾时弃车跳河逃避检查，反复跳河3次，最终血检发现其酒精含量为0。",
            "一女子因多次迟到被公司辞退，申请劳动仲裁，但在仲裁开庭当天又迟到16分钟。",
            "一男子伪装成塑料袋在凌晨3点行窃写字楼，作案后用塑料袋套住自己离开。",
            "警方抓获一名窃贼，该窃贼认为中午犯案比早晚更安全，因为“早晚会被抓”。",
            "派出所接到报警，辖区一村民家门口摆放的两尊重达百斤石狮子一夜之间被人盗了。民警展开调查，经过几个小时的走访，查看监控，终于发现可疑线索，抓获了嫌疑人孙某。问及为何要盗窃这么沉的石狮子，孙某称：他路过报警人家门口，当即被石狮子吸引，仔细端详后，越看越顺眼。",
            "一书店有《周易》失窃，民警快速抓获嫌疑人曹某。曹某称，自己命不好，没钱买书，想偷本《周易》研究一下为什么。最终，曹某因盗窃被依法拘留。",
            "骗子尝试了4个小时也没能教会大妈如何转账，大妈因此逃过一劫。",
            "一男子希望被警方拘留但没有成功，于是致电热线希望得到帮助。原来其多年前因违法，后刑满释放，但现作息不规律，吕某担心再次犯罪，于是求助热线。",
            "沈女士与一男子网恋，被骗百万后被拉黑。沈女士报警后却又接到男子的主动联系。奔现被抓男子称：受害者很大方，自己动了真感情。",
            "某地法院公开审理一起开设赌场案，过程中警察发现旁听席一人似在逃犯罪嫌疑人。庭审结束后将男子当场制服，最终男子被刑拘。",
            "养了10多年的孩子，有一天竟发现不是自己的，这电视剧般的“狗血剧情”近日还真实地发生在一位男子身上，妻子离家出走，男子希望其能归家。他与妻子结婚16年最近才被妻子告知自己的三个女儿都不是他亲生的。",
            "犯罪嫌疑人被抓时仍在看刑法学讲义，书中“如何缓刑、减刑”等内容都被划了重点。网友疯狂调侃。",
            "儿媳到派出所接迷路的婆婆回家，半小时后女子又向警方求助：我俩又迷路了……",
            "一男子因涉嫌诈骗被警方抓获，为逃避调查，他装晕3天3夜，期间医生想尽办法，插尿管、上心电、掐人中等，他都纹丝不动，没有反应。哪知最后，因忍受不了民警在他床前吃饭太香被“唤醒”。目前，男子已被警方依法刑拘。",
            "某小伙家境殷实，但觉得管爸妈要钱“没面子”，选择白手起家自主创业，终于成为电信诈骗头目被捕。",
            "某地一群人聚餐，在室内吃炭锅，门窗紧闭导致全员一氧化碳中毒晕倒。最关键的是，期间有一个男子开门透气，结果朋友以为他喝多了，又给他拉回屋内。",
            // 添加更多的剧本内容...
        };
        */
        //为每个story添加3个可选的标题
        mainStoryTitles = new string[,]
        {
            {"市民田女士因夫妻矛盾被介绍给自称“妙法如来”转世的续某，她花费5万余元购买了五百瓶“甘露水”，后发现无效，报警后得知“甘露水”实为自来水。","花五万买大师加持“甘露水”喝后发现无效 ","“妙法如来”现某地，“甘露水”竟是“自来水”","夫妻矛盾引“神通”？“甘露水”不相信眼泪"},
            {"警方接到报警称功德箱内香火钱被偷，嫌疑人覃某辩称自己不是偷，而是问菩萨能否拿钱，称菩萨比了“OK”。","男子偷功德箱的钱称“菩萨给我比了OK ”","菩萨说可以我才拿的“盗亦有道”？！","香火钱变盗？菩萨“说OK”"},
            {"田老太的儿子因诈骗被判刑，田老太拒绝退赔后，被何某以能改判减刑为由骗走30万元。","儿子诈骗30万 老太拒绝退赔 后为捞儿子出狱老太被骗30万 ","骗子家庭上“减刑”当竞对能力值得认可！","诈骗款不会消失，但会转移"},
            {"一男子与同事争吵后决定徒步回B地，后被民警发现其走反了方向，并帮助他上了前往B地的火车。","男子争吵后不吃不喝欲从A地走回B地结果走反了","男子city walk“南辕北辙”也可到终点","男子暴走，只为徒步证明地球是圆的？！跟上男子的节奏！"},
            {"一司机在查酒驾时弃车跳河逃避检查，反复跳河3次，最终血检发现其酒精含量为0。","男子躲查酒驾3次跳河结果血检酒精含量为0","司机逃避酒驾检查3次，血检却是零","反复跳河躲检查！司机酒驾查出意外"},
            {"一女子因多次迟到被公司辞退，申请劳动仲裁，但在仲裁开庭当天又迟到16分钟。","入职58天迟到21次 被辞后申请仲裁开庭当天又迟到16分钟 ","女子亲验 21天真能养习惯！！！","迟到成习惯！女子申请仲裁当天再次迟到相当自律！"},
            {"一男子伪装成塑料袋在凌晨3点行窃写字楼，作案后用塑料袋套住自己离开。","伪装成塑料袋 男子凌晨3点写字楼行窃 ","奇招作案！ “塑料袋”行窃写字楼","塑料袋盗贼惊动警方！"},
            {"警方抓获一名窃贼，该窃贼认为中午犯案比早晚更安全，因为“早晚会被抓”。","窃贼专挑中午犯案 只因认为“早晚会被抓” ","注意进“chang”时机！","现代人时间意识有多强？ 盗贼犯案都狠抓Timing！！"},
            {"派出所接到报警，辖区一村民家门口摆放的两尊重达百斤石狮子一夜之间被人盗了。民警展开调查，经过几个小时的走访，查看监控，终于发现可疑线索，抓获了嫌疑人孙某。问及为何要盗窃这么沉的石狮子，孙某称：他路过报警人家门口，当即被石狮子吸引，仔细端详后，越看越顺眼。","男子盗窃百斤重石狮子就因为越看越顺眼","对视·对狮·对失","一见钟情 男子迈出120步实在越界"},
            {"一书店有《周易》失窃，民警快速抓获嫌疑人曹某。曹某称，自己命不好，没钱买书，想偷本《周易》研究一下为什么。最终，曹某因盗窃被依法拘留。","男子因“命不好”想研究一下到书店偷《周易》被抓","天机不可泄露 男子欲解命运遭“报应”","“周易”命不易 男子知天命"},
            {"骗子尝试了4个小时也没能教会大妈如何转账，大妈因此逃过一劫。","南京一大妈接到诈骗电话，骗子教大妈转账未遂","没有教师资格证当什么骗子？！","教学数时仍不会 银龄大妈被放弃 谁来关心未来的自己"},
            {"一男子希望被警方拘留但没有成功，于是致电热线希望得到帮助。原来其多年前因违法，后刑满释放，但现作息不规律，吕某担心再次犯罪，于是求助热线。","广东男子刑满释放后求助12345，想回看守所：我想过规律的生活","看守所的小房间才是我向往的家啊！","市民拨打热线求助 请求遭拒引热议"},
            {"沈女士与一男子网恋，被骗百万后被拉黑。沈女士报警后却又接到男子的主动联系。奔现被抓男子称：受害者很大方，自己动了真感情。","男子诈骗百万爱上受害人，奔现被抓：受害人很大方，自己动了真感情","百万女总我爱上","真花钱才是真爱你 男子遭pua失去自由"},
            {"某地法院公开审理一起开设赌场案，过程中警察发现旁听席一人似在逃犯罪嫌疑人。庭审结束后将男子当场制服，最终男子被刑拘。","一逃犯到法院旁听自己的案件，因座位太靠前被民警认出","枪打出头鸟 我就说听课不要太靠前","这么认真的人怎么可能不是坏人！"},
            {"养了10多年的孩子，有一天竟发现不是自己的，这电视剧般的“狗血剧情”近日还真实地发生在一位男子身上，妻子离家出走，男子希望其能归家。他与妻子结婚16年最近才被妻子告知自己的三个女儿都不是他亲生的。","血缘并非必须 真爱能敌十年","男子赡养无亲缘关系孩子十多年 果真人间有真情？！","男子养三孩十数年 终于崩溃大哭为那般？！"},
            {"犯罪嫌疑人被抓时仍在看刑法学讲义，书中“如何缓刑、减刑”等内容都被划了重点。网友疯狂调侃。","男子以身入局 检验司法实践","我太想进步了！","学而行——知行合一引群嘲"},
            {"儿媳到派出所接迷路的婆婆回家，半小时后女子又向警方求助：我俩又迷路了……","不是一家人 不进一家门","婆婆儿媳太相近 “我与你相似”","归家路漫漫 儿媳陪婆婆一起迷失"},
            {"一男子因涉嫌诈骗被警方抓获，为逃避调查，他装晕3天3夜，期间医生想尽办法，插尿管、上心电、掐人中等，他都纹丝不动，没有反应。哪知最后，因忍受不了民警在他床前吃饭太香被“唤醒”。目前，男子已被警方依法刑拘。","男子被抓装晕3天3夜 警察吃饭太香被馋醒：真的扛不住","这一刻，美食击败了自由","医生哪懂唤醒 警官给大白上了一课"},
            {"某小伙家境殷实，但觉得管爸妈要钱“没面子”，选择白手起家自主创业，终于成为电信诈骗头目被捕。","年度“励志”富二代的迷惑操作","不安心啃老？你这是违法行为！","是富二代，也是诈骗犯"},
            {"某地一群人聚餐，在室内吃炭锅，门窗紧闭导致全员一氧化碳中毒晕倒。最关键的是，期间有一个男子开门透气，结果朋友以为他喝多了，又给他拉回屋内。","《友谊地久天长》","一声兄弟感天地——岂能“独活”","“暖心”举动让人“窒息”"},
        };
        //为每个story添加3个可选的反馈
        //用一种方法将mainStoryTtiles按行随机打乱
        ShuffleRows(mainStoryTitles);
        PrintArray(mainStoryTitles);

        //在mainStoryTitles的第十二个位置插入一条故事
        //mainStoryTitles[11] = new string[] { "近日，新闻组接到电话新闻线索。线索提供者举报称“庐市”听障特校存在恶性侵害事件。因现有线索有限，现特张贴线索征集启事。如您有任何线索，可以发送到邮箱xinwenxinwen@xw.com。", "庐市”特校疑似存在儿童侵害问题，诚求线索", "“特校”是天堂还是地狱，举报是否空穴来风？！", "今日线索征集——听障特校大求真" };
        mainStoryFeedBacks = new string[,]
        {
            {"feedback1.1","feedback1.2","feedback1.3"},
            {"feedback2.1","feedback2.2","feedback2.3"},
            {"feedback3.1","feedback3.2","feedback3.3"},
            {"feedback4.1","feedback4.2","feedback4.3"},
            {"feedback5.1","feedback5.2","feedback5.3"},
        };
        //初始化玩家的选择 全部为0
        playerChoiceIndexs = new int[mainStoryTitles.Length];
        playerChoiceBlockIndexs = new int[mainStoryTitles.Length];
        //初始化权重 并给他们赋值为0
        

    }
}
